content/posts-org/add-users-into-accessionui.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Add uses into accessioning UI
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-01-01
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here
* Env setup
 - in aws_profile Master-oncall
 - using aws production VPN

* Accessing DB
#+begin_src bash
$ PGPASSWORD='W*2AAnQdWWWHw8OowmGs' psql accessioning  --host=accessioning-aurora-hipaa.cluster-ctc4k8bzul0z.us-east-1.rds.amazonaws.com --port=5432 --user='accessioning-service'
#+end_src

* SQL
#+begin_src bash
BEGIN;
INSERT INTO users (user_email, role) VALUES 
('jennifer.corona@helix.com','STAFF'), 
('maryam.kako@helix.com', 'STAFF'),
('reanna.hutalla@helix.com', 'STAFF'),
('mimi.luong@helix.com', 'STAFF'),
('tatyana.lemus@helix.com', 'STAFF'),
('trang.vu@helix.com', 'STAFF'),
('sonia.bouathong@helix.com', 'STAFF'),
('marco.villascueza@helix.com', 'STAFF'),
;
COMMIT;
#+end_src
* Links
 - https://myhelix.atlassian.net/wiki/spaces/PS/pages/1947828747/How+to+add+Users+to+Accessioning+HAMUI
